package com.cn.auth.entity;

/**
 * 提示编码对应常量
 * 
 * @基本异常B开头，业务异常T开头
 * 
 * @author chen.jiaming
 *
 */
public enum ResultMessageConstants {
	B00001("未定义异常"), B00002("远程服务异常"), B00003("未登录异常"), B00004("未获取sid异常"), //
	B00005("请求令牌重复"), B00006("没有权限"), B00007("找不到对应请求资源"), B00008("认证未通过"), //
	B00009("会话超时"),B00010("请求令牌超时"),B00011("非法的token"),
	SUCCESS("操作成功"),
	T00000_("数据校验错误"), T00001("对象或者主键为空异常"), T00002("名称重复"), T00003("密码错误"), //
	T00004("关联属性为空异常"), T00005("一定时间内不能重复请求"), T00006("删除失败"), //
	T00007("更新失败"), T00008("单据明细错误"), T00009("执行过程出错"), T00010("单据状态被锁定"), //
	T00011("明细为空"),T00012("对象已存在, 不允许重复"),
	T00013("未申请企业资料"),T00014("企业资料未审核"),
	TA0000("验证码错误"), TA0001("用户或者密码错误"), TQ0000("QQ获取code异常"), TW0000("微信获取code异常"), //

	;
	/** ********************** 分割线 ****************************** */
	private String message;

	ResultMessageConstants() {
	}

	ResultMessageConstants(String message) {
		this.message = message;
	}

	public String message() {
		return message;
	}
}
